export const regexes = String.raw`{長い…を二個分の…に}
/…{2,}/g, "……"
/\n*(\<span\ lang\=\"ja\"\>……\<\/span\>)\n*/g, "……"

{不要な記述を削除}
/(?:出席議員|欠席議員|欠員|説明のため出席した者|職務のため議場に出席した事務局職員|議事日程|開会宣告)…….*\n/g, ""

{一括上程をまとめる}
/((?:.*＋[\s\S][^＋]*＋\n　*（.*）\n)|(?:.*＋[\s\S][^＋]*＋\n))/gm, "<fieldset class=\"ikkatu\"><legend>一括</legend>$1</fieldset><br>"
/^(.*｜)（一括上程）.*$/gm, "$1"
/^(.*)＋\n　+(.*｜)$/gm, "$1$2"
/(　+)((?:（|\().*報告(?:）|\)))＋/gm, "_pre$1$2｜"
/　*｜\n　+([^｜　]*)　*/gm, "$1"
/^(.+)[｜＋]$/gm, "$1"
/_pre/g, ""

{リンクを変換}
/\<strong\>\<a href=\"(.*)\"\ target\=\"_self\"\>(.*)\<\/a\>\<\/strong\>/gm, "<a href=\"{baseUrl}$1\">$2</a>"

{改行を<BR>に}
/\r?\n/g, "<br>"
`;