export const regexes = String.raw`{長い…を二個分の…に}
/…{2,}/g, "……"
/\n*(\<span\ lang\=\"ja\"\>……\<\/span\>)\n*/g, "……"

{不要な記述を削除}
/(?:出席議員|欠席議員|欠員|説明のため出席した者|職務のため議場に出席した事務局職員|議事日程|開会宣告)…….*\n/g, ""

{一括上程・付託・報告をまとめる}
/((?:.*＋[\s\S][^＋]*＋\n[ 　]*（.*）\n)|(?:.*＋[\s\S][^＋]*＋\n))/g, "<fieldset class=\"ikkatu\"><legend>一括</legend>$1</fieldset><br>"
/^(.*｜)（一括上程）.*$/gm, "$1"
/^(.*)[ 　]*＋\n[ 　]+([^ 　]*)[ 　]*｜$/gm, "$1$2｜"
/([ 　]+)([（\(].*(?:報告|付託)[）\)])[ 　]*＋/g, "_pre$1$2｜"
/[ 　]*｜\n[ 　]+([^｜ 　]*)[ 　]*/g, "$1"
/^(.+)[｜＋]$/gm, "$1"
/_pre/g, ""

{リンクを変換}
/\<strong\>\<a href=\"(.*)\"\ target\=\"_self\"\>(.*)\<\/a\>\<\/strong\>/g, "<a href=\"{baseUrl}$1\">$2</a>"

{日付変換}
/^(◯.+月.+日（.+）[ 　]*\n)/gm, "<div class=\"date\">$1</div>"
/^[ 　]+(.+月.+日（.+）[ 　]*\n)/gm, "<h2 class=\"date\">$1</h2>"

{目次・開会・開議・日程・追加日程}
/^[ 　]+(目次.*\n)/gm, "<h1>$1</h1>"
/^[ 　]+(.+年.+月小平市議会定例会会議録.*\n)/gm, "<h1>$1</h1>"
/^[ 　]+(午(?:前|後).*時.*分.*(?:開議|開会・開議)[ 　]*\n)/gm, "<h3 class=\"open\">$1</h3>"
/^(議事日程)[ 　]*\n/gm, "<h3 class=\"nittei\">$1</h3>"
/^[ 　]－+\n^○((?:追加)*日程.*[ 　].*)/gm, "<h4 class=\"nittei\">$1</h4>"
/^○((?:追加)*日程.*[ 　].*)/gm, "<h4 class=\"nittei\">$1</h4>"
/^○(〈(?:議会事務局|理事者側)の説明〉)/gm, "<h5>$1</h5>"
/^○(〈質疑〉)/gm, "<h5>$1</h5>"

{議長・議員・理事者等} 
/^○(.*(?:（.*）|委員|委員長))[  　](.*)\n/gm, "<div class=\"speak-start\"><strong>$1</strong> $2</div>"

{特定のタグ前後の空白＋改行は削除し、改行を<BR>に}
/[ 　]*(\n)/gm, "$1"
/\n*(\<[\/]?(?:h[123456]|div|td|th|tr|tbody|table|br)\>)\n*/gm, "$1"
/\r?\n/g, "<br>"
`;