export const regexes = String.raw`{長い…を二個分の…に}
/…{2,}/g, "……"
/\n*(\<span\ lang\=\"ja\"\>……\<\/span\>)\n*/g, "……"

{不要な記述を削除}
/(?:出席議員|欠席議員|欠員|説明のため出席した者|職務のため議場に出席した事務局職員|議事日程|開会宣告)…….*\n/g, ""

{一括上程をまとめる}
/((?:.*＋[\s\S][^＋]*＋\n　*（.*）\n)|(?:.*＋[\s\S][^＋]*＋\n))/g, "<fieldset class=\"ikkatu\"><legend>一括</legend>$1</fieldset><br>"
/^(.*｜)（一括上程）.*$/gm, "$1"
/^(.*)＋\n　+(.*｜)$/gm, "$1$2"
/(　+)((?:（|\().*報告(?:）|\)))＋/g, "_pre$1$2｜"
/　*｜\n　+([^｜　]*)　*/g, "$1"
/^(.+)[｜＋]$/gm, "$1"
/_pre/g, ""

{リンクを変換}
/\<strong\>\<a href=\"(.*)\"\ target\=\"_self\"\>(.*)\<\/a\>\<\/strong\>/g, "<a href=\"{baseUrl}$1\">$2</a>"

{日付変換}
/^[ 　]*(.*月.*日（.*）[ 　]*\n)/gm, "<h2 class=\"date\">$1</h2>"

{開会・開議・日程・追加日程}
/^[ 　]+(午(?:前|後).*時.*分.*開会・開議[ 　]*\n)/gm, "<h3 class=\"open\">$1</h3>"
/^[ 　]－+\n^○((?:追加)*日程.*[ 　].*)/gm, "<h4 class=\"nittei\">$1</h4>"
/^○((?:追加)*日程.*[ 　].*)/gm, "<h4 class=\"nittei\">$1</h4>"

{議長・議員・理事者等} 
/^○(.*（.*）)[  　](.*)\n/gm, "<div class=\"speak-start\"><strong>$1</strong> $2</div>"

{特定のタグ後の改行は削除し、改行を<BR>に}
/(\<\/(?:h[123456]|div)\>)\n*/gm, "$1"
/\r?\n/g, "<br>"
`;